wisteria-1c/Конфигурация/DataProcessors/Мессенджеры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>Мессенджеры</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

wisteria-1c/Конфигурация/InformationRegisters/СвязиКонтрагентЛид.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СвязиКонтрагентЛид</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Лид</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лиды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

wisteria-1c/Конфигурация/Enums/ВидыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыКонтрагентов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮридическоеЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИндивидуальныйПредприниматель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФизическоеЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГосударственныйОрган</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

wisteria-1c/Конфигурация/Enums/ВидыЛидов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыЛидов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПервичноеОбращение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПовторноеОбращение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

wisteria-1c/Конфигурация/Enums/ВариантЗавершенияРаботыСЛидом.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВариантЗавершенияРаботыСЛидом</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПереведенВПокупателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НекачественныйЛид</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

wisteria-1c/Конфигурация/Catalogs/КонтактныеЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>КонтактныеЛица</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресЭПДляПоиска</Name>
					<Comment>Адрес ЭП для поиска при вводе по строке</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыДоступаКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументУдостоверяющийЛичность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникПривлечения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиПривлеченияПокупателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Недействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТелефонаДляПоиска</Name>
					<Comment>Номер телефона для поиска при вводе по строке</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновныеСведения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пол</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПолФизическогоЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокРолей</Name>
					<Comment>Для представления в списках</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьДолжность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьРеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФамилияИнициалы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Роли</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Роль</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РолиКонтактныхЛиц</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Теги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тег</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Теги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

wisteria-1c/Конфигурация/DataProcessors/Мессенджеры/Forms/ФормаКонтактовАбонента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НомерТелефона = Параметры.НомерТелефона;
	Если ПустаяСтрока(НомерТелефона) Тогда
		ВызватьИсключение НСтр("ru='Недопустимый вызов формы'");
	КонецЕсли;
	
	ТипКИ = Перечисления.ТипыКонтактнойИнформации.Телефон;
	
	ОбновитьСписок();
	УправлениеФормой();
	УстановитьУсловноеОформление();
	
	Если ДеревоКонтактов.ПолучитьЭлементы().Количество() > 0 Тогда
		НомерСтроки = 1;
		Элементы.ДеревоКонтактов.ТекущаяСтрока = НомерСтроки;
	КонецЕсли;

	ИзменитьИнтерфейсДляМобильногоКлиента();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДеревоКонтактов

&НаКлиенте
Процедура ДеревоКонтактовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Элементы.ДеревоКонтактов.ТекущиеДанные = Неопределено Или Не ВыбранаСтрокаСКлиентом()
		Или Не ЗначениеЗаполнено(Элементы.ДеревоКонтактов.ТекущиеДанные.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьКлиента();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОткрытьКлиента()
	
	Если Не ВыбранаСтрокаСКлиентом() Тогда
		Возврат;
	КонецЕсли;
		
	Ссылка = Элементы.ДеревоКонтактов.ТекущиеДанные.Ссылка;
	Если Не ЧтениеРазрешено(Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	ПоказатьЗначение(, Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура УправлениеФормой()
	
	Элементы.ДеревоКонтактовПредставлениеКИ.Видимость = ЗначениеЗаполнено(ТипКИ);
	Элементы.ДеревоКонтактовПредставлениеКИ.Заголовок =  НСтр("ru = 'Телефон'");
		
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(
	НовоеУсловноеОформление.Отбор,
		"ДеревоКонтактов.Ссылка", Неопределено, ВидСравненияКомпоновкиДанных.Заполнено);
	
	ОформляемыеПоля = Новый Массив;
	ОформляемыеПоля.Добавить(Элементы.ДеревоКонтактовНаименованиеГруппы.Имя);
	
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, ОформляемыеПоля);
	
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(
		НовоеУсловноеОформление, "Видимость", Ложь);
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(
		НовоеУсловноеОформление, "Отображать", Ложь);
	
	НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
	
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(
	НовоеУсловноеОформление.Отбор,
		"ДеревоКонтактов.Ссылка", Неопределено, ВидСравненияКомпоновкиДанных.НеЗаполнено);
	
	ОформляемыеПоля = Новый Массив;
	ОформляемыеПоля.Добавить(Элементы.ДеревоКонтактовНомерИконки.Имя);
	ОформляемыеПоля.Добавить(Элементы.ДеревоКонтактовНаименование.Имя);
	ОформляемыеПоля.Добавить(Элементы.ДеревоКонтактовПредставлениеКИ.Имя);
	ОформляемыеПоля.Добавить(Элементы.ДеревоКонтактовТипКлиента.Имя);
	ОформляемыеПоля.Добавить(Элементы.ДеревоКонтактовКод.Имя);
	ОформляемыеПоля.Добавить(Элементы.ДеревоКонтактовТипКлиента.Имя);
	
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, ОформляемыеПоля);
	
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(
		НовоеУсловноеОформление, "Видимость", Ложь);
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(
		НовоеУсловноеОформление, "Отображать", Ложь);
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьИнтерфейсДляМобильногоКлиента()
	
	Если Не ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ДеревоКонтактов.Шапка = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписок()
	
	ДеревоКонтактов.ПолучитьЭлементы().Очистить();	
	
	ИспользоватьКонтактыКонтрагентов = ПолучитьФункциональнуюОпцию("ИспользоватьКонтактыКонтрагентов");
	ИспользоватьЛиды = ПолучитьФункциональнуюОпцию("ИспользоватьЛиды");
	
	ТекстЗапроса = 
	"ВЫБРАТЬ ПЕРВЫЕ 20
	|	Контрагенты.Ссылка КАК Ссылка,
	|	Контрагенты.Код КАК Код,
	|	Контрагенты.Наименование КАК Наименование,
	|	ВЫРАЗИТЬ(Контрагенты.НомерТелефонаДляПоиска КАК СТРОКА(1000)) КАК ПредставлениеКИ,
	|	""Контрагент"" КАК Тип,
	|	1 КАК РеквизитДопУпорядочивания,
	|	ВЫБОР
	|		КОГДА Контрагенты.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ВидыКонтрагентов.ИндивидуальныйПредприниматель)
	|				ИЛИ Контрагенты.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ВидыКонтрагентов.ФизическоеЛицо)
	|			ТОГДА ВЫБОР
	|					КОГДА Контрагенты.ПометкаУдаления
	|						ТОГДА 11
	|					ИНАЧЕ 3
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Контрагенты.ПометкаУдаления
	|					ТОГДА 10
	|				ИНАЧЕ 2
	|			КОНЕЦ
	|	КОНЕЦ КАК НомерИконки,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(Контрагенты.Ответственный) КАК ОтветственныйПредставление,
	|	Контрагенты.ПометкаУдаления КАК ПометкаУдаления,
	|	"""" КАК Представление,
	
	|	ВЫБОР
	|		КОГДА Контрагенты.Покупатель И Контрагенты.Поставщик И Контрагенты.ПрочиеОтношения
	|			ТОГДА &ТипКонтрагентаПокупательПоставщикПрочиеОтношения
	|		КОГДА Контрагенты.Покупатель И Контрагенты.Поставщик
	|			ТОГДА &ТипКонтрагентаПокупательПоставщик
	|		КОГДА Контрагенты.Покупатель И Контрагенты.ПрочиеОтношения
	|			ТОГДА &ТипКонтрагентаПокупательПрочиеОтношения
	|		КОГДА Контрагенты.Поставщик И Контрагенты.ПрочиеОтношения
	|			ТОГДА &ТипКонтрагентаПоставщикПрочиеОтношения
	|		КОГДА Контрагенты.Покупатель
	|			ТОГДА &ТипКонтрагентаПокупатель
	|		КОГДА Контрагенты.Поставщик
	|			ТОГДА &ТипКонтрагентаПоставщик
	|		КОГДА Контрагенты.ПрочиеОтношения
	|			ТОГДА &ТипКонтрагентаПрочиеОтношения
	|		ИНАЧЕ
	|			&ТипКонтрагентаБезПризнака
	|	КОНЕЦ КАК ТипКлиента
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.НомерТелефонаДляПоиска ПОДОБНО &ПредставлениеКИ СПЕЦСИМВОЛ ""~""";
	
	Если ИспользоватьКонтактыКонтрагентов Тогда
		ТекстЗапроса = ТекстЗапроса
		+ "
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ ПЕРВЫЕ 20
		|	Контакты.Ссылка,
		|	Контакты.Код,
		|	Контакты.Наименование,
		|	ВЫРАЗИТЬ(Контакты.НомерТелефонаДляПоиска КАК СТРОКА(1000)),
		|	""Контакт"",
		|	2,
		|	ВЫБОР
		|		КОГДА Контакты.ПометкаУдаления
		|			ТОГДА 12
		|		ИНАЧЕ 4
		|	КОНЕЦ,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(Контакты.Ответственный),
		|	Контакты.ПометкаУдаления,
		|	"""",
		|	&ТипКонтакт КАК ТипКлиента
		|ИЗ
		|	Справочник.КонтактныеЛица КАК Контакты
		|ГДЕ
		|	Контакты.НомерТелефонаДляПоиска ПОДОБНО &ПредставлениеКИ СПЕЦСИМВОЛ ""~""";
	
	КонецЕсли;
	
	Если ИспользоватьЛиды Тогда
		ТекстЗапроса = ТекстЗапроса
		+ " 
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ ПЕРВЫЕ 20
		|	Лиды.Ссылка,
		|	Лиды.Код,
		|	Лиды.Наименование,
		|	ВЫРАЗИТЬ(ЕСТЬNULL(СвязиКонтрагентЛид.Контрагент.НомерТелефонаДляПоиска, Лиды.НомерТелефонаДляПоиска) КАК СТРОКА(1000)),
		|	""Лид"",
		|	3,
		|	ВЫБОР
		|		КОГДА Лиды.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыЛидов.ПовторноеОбращение)
		|			ТОГДА ВЫБОР
		|					КОГДА Лиды.ПометкаУдаления
		|						ТОГДА 16
		|					ИНАЧЕ 8
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА Лиды.ПометкаУдаления
		|					ТОГДА 15
		|				ИНАЧЕ 7
		|			КОНЕЦ
		|	КОНЕЦ,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(Лиды.Ответственный),
		|	Лиды.ПометкаУдаления,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(Лиды.Ссылка),
		|	ВЫБОР
		|		КОГДА Лиды.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыЛидов.ПервичноеОбращение)
		|			ТОГДА &ТипЛидаПервичноеОбращение
		|		КОГДА Лиды.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыЛидов.ПовторноеОбращение)
		|			ТОГДА &ТипЛидаПовторноеОбращение
		|		ИНАЧЕ &ТипЛидаБезПризнака
		|	КОНЕЦ КАК ТипКлиента
		|ИЗ
		|	Справочник.Лиды КАК Лиды
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СвязиКонтрагентЛид КАК СвязиКонтрагентЛид
		|		ПО Лиды.Ссылка = СвязиКонтрагентЛид.Лид
		|ГДЕ
		|	Лиды.ВариантЗавершения <> ЗНАЧЕНИЕ(Перечисление.ВариантЗавершенияРаботыСЛидом.ПереведенВПокупателя)
		|	И ВЫБОР
		|			КОГДА Лиды.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыЛидов.ПовторноеОбращение)
		|				ТОГДА ЕСТЬNULL(СвязиКонтрагентЛид.Контрагент.НомерТелефонаДляПоиска, Лиды.НомерТелефонаДляПоиска)
		|			ИНАЧЕ Лиды.НомерТелефонаДляПоиска
		|		КОНЕЦ ПОДОБНО &ПредставлениеКИ СПЕЦСИМВОЛ ""~""";
	
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса 
	+ "
	|
	|УПОРЯДОЧИТЬ ПО
	|	РеквизитДопУпорядочивания,
	|	Наименование";
	

	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	
	ПредставлениеКИДляПоиска = КонтактнаяИнформацияУНФ.ПреобразоватьНомерДляКонтактнойИнформации(НомерТелефона);
	ПредставлениеКИДляПоиска = СтрЗаменить(ПредставлениеКИДляПоиска, "+", "");
	Если СтрНачинаетсяС(ПредставлениеКИДляПоиска, "7") Тогда
		ПредставлениеКИДляПоиска = Сред(ПредставлениеКИДляПоиска, 2, СтрДлина(ПредставлениеКИДляПоиска) - 1);
	КонецЕсли;

	Запрос.УстановитьПараметр("ПредставлениеКИ",
		СтрШаблон("%%%1%%", ОбщегоНазначения.СформироватьСтрокуДляПоискаВЗапросе(ПредставлениеКИДляПоиска)));

	ТипКонтрагентаБезПризнака = "";
	ТипКонтрагентаПрочиеОтношения =                    НСтр("ru = 'Прочие отношения'");
	ТипКонтрагентаПоставщик =                          НСтр("ru = 'Поставщик'");
	ТипКонтрагентаПокупатель =                         НСтр("ru = 'Покупатель'");
	ТипКонтрагентаПоставщикПрочиеОтношения =           НСтр("ru = 'Поставщик, Прочие отношения'");
	ТипКонтрагентаПокупательПрочиеОтношения =          НСтр("ru = 'Покупатель, Прочие отношения'");
	ТипКонтрагентаПокупательПоставщик =                НСтр("ru = 'Покупатель, Поставщик'");
	ТипКонтрагентаПокупательПоставщикПрочиеОтношения = НСтр("ru = 'Покупатель, Поставщик, Прочие отношения'");
		
	Запрос.УстановитьПараметр("ТипКонтрагентаПокупательПоставщикПрочиеОтношения",
		ТипКонтрагентаПокупательПоставщикПрочиеОтношения);
	Запрос.УстановитьПараметр("ТипКонтрагентаПокупательПоставщик",       ТипКонтрагентаПокупательПоставщик);
	Запрос.УстановитьПараметр("ТипКонтрагентаПокупательПрочиеОтношения", ТипКонтрагентаПокупательПрочиеОтношения);
	Запрос.УстановитьПараметр("ТипКонтрагентаПокупатель",                ТипКонтрагентаПокупатель);
	Запрос.УстановитьПараметр("ТипКонтрагентаПоставщикПрочиеОтношения",  ТипКонтрагентаПоставщикПрочиеОтношения);
	Запрос.УстановитьПараметр("ТипКонтрагентаПоставщик",                 ТипКонтрагентаПоставщик);
	Запрос.УстановитьПараметр("ТипКонтрагентаПрочиеОтношения",           ТипКонтрагентаПрочиеОтношения);
	Запрос.УстановитьПараметр("ТипКонтрагентаБезПризнака",               ТипКонтрагентаБезПризнака);

	ТипКонтакт = НСтр("ru='Контакт'");
	Запрос.УстановитьПараметр("ТипКонтакт", ТипКонтакт);
	
	ТипЛидаБезПризнака = "";
	ТипЛидаПервичноеОбращение = НСтр("ru = 'Первичное обращение'");
	ТипЛидаПовторноеОбращение = НСтр("ru = 'Повторное обращение'");
	
	Запрос.УстановитьПараметр("ТипЛидаБезПризнака",        ТипЛидаБезПризнака);
	Запрос.УстановитьПараметр("ТипЛидаПервичноеОбращение", ТипЛидаПервичноеОбращение);
	Запрос.УстановитьПараметр("ТипЛидаПовторноеОбращение", ТипЛидаПовторноеОбращение);
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	
	СтрокаГруппыКонтрагентов = Неопределено;
	СтрокаГруппыКонтактов = Неопределено;
	СтрокаГруппыЛидов = Неопределено;
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Тип = "Контрагент" Тогда
			
			Если СтрокаГруппыКонтрагентов = Неопределено Тогда
				СтрокаГруппыКонтрагентов = ДеревоКонтактов.ПолучитьЭлементы().Добавить();
				СтрокаГруппыКонтрагентов.Наименование = НСтр("ru = 'Контрагенты'");
				СтрокаГруппыКонтрагентов.НомерИконки = -1;
				СтрокаГруппыКонтрагентов.Тип = "Контрагент";
			КонецЕсли;
			
			СтрокаГруппировки = СтрокаГруппыКонтрагентов;
			
		КонецЕсли;
		
		Если Выборка.Тип = "Контакт" Тогда
			
			Если СтрокаГруппыКонтактов = Неопределено Тогда
				СтрокаГруппыКонтактов = ДеревоКонтактов.ПолучитьЭлементы().Добавить();
				СтрокаГруппыКонтактов.Наименование = НСтр("ru = 'Контакты'");
				СтрокаГруппыКонтактов.НомерИконки = -1;
				СтрокаГруппыКонтактов.Тип = "Контакт";
			КонецЕсли;
			
			СтрокаГруппировки = СтрокаГруппыКонтактов;
			
		КонецЕсли;
		
		Если Выборка.Тип = "Лид" Тогда
			
			Если СтрокаГруппыЛидов = Неопределено Тогда
				СтрокаГруппыЛидов = ДеревоКонтактов.ПолучитьЭлементы().Добавить();
				СтрокаГруппыЛидов.Наименование = НСтр("ru = 'Лиды'");
				СтрокаГруппыЛидов.НомерИконки = -1;
				СтрокаГруппыЛидов.Тип = "Лид";
			КонецЕсли;
			
			СтрокаГруппировки = СтрокаГруппыЛидов;
			
		КонецЕсли;
		
		НоваяСтрока = СтрокаГруппировки.ПолучитьЭлементы().Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
	КонецЦикла;
	
КонецПроцедуры

#Область РаботаСДеревом

&НаКлиенте
Функция ВыбранаСтрокаСКлиентом()
	
	Результат = Элементы.ДеревоКонтактов.ТекущиеДанные <> Неопределено;
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ПроверкаПравПользователя

&НаКлиенте
Функция ЧтениеРазрешено(Ссылка)
	
	ЧтениеРазрешено = ЧтениеРазрешеноНаСервере(Ссылка);
	Если Не ЧтениеРазрешено Тогда
		ПредупреждениеОНевозможностиЧтенияОбъекта();
	КонецЕсли;
	
	Возврат ЧтениеРазрешено;
	
КонецФункции

&НаСервереБезКонтекста
Функция ЧтениеРазрешеноНаСервере(Знач Ссылка)
	
	Возврат УправлениеДоступом.ЧтениеРазрешено(Ссылка);
	
КонецФункции

&НаКлиенте
Процедура ПредупреждениеОНевозможностиЧтенияОбъекта()
	
	ПоказатьПредупреждение(, НСтр("ru = 'Нет прав на чтение объекта'"));
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
